/**
 * Original filename: dm_game_main.c
 */

#include "dm_game_main.h"

#include "defines.h"
#include "macros_defines.h"

#include "libc/assert.h"
#include "libc/stdbool.h"
#include "gcc/memory.h"

#include "066580.h"
#include "aiset.h"
#include "audio/sound.h"
#include "bg_tasks.h"
#include "buffers.h"
#include "calc.h"
#include "debug_menu.h"
#include "dm_main_cnt.h"
#include "dm_thread.h"
#include "dm_virus_init.h"
#include "game_etc.h"
#include "graphic.h"
#include "main1x.h"
#include "main_story.h"
#include "nnsched.h"
#include "record.h"
#include "replay.h"
#include "rom_offsets.h"
#include "static.h"
#include "tex_func.h"
#include "util.h"
#include "vr_init.h"

#if VERSION_US || VERSION_GW || CC_CHECK
#else
#define AVOID_JOY_FUNCTIONS 1
#endif
#include "joy.h"

#if VERSION_CN && !CC_CHECK
void joyCursorFastSet(u16 mask, u8 index);
#endif

// Maybe it is checking if player0 is non-human? or maybe debug related?
#define UNK_PLAYER0_CHECK2(state, player_no) \
    (((state)->player_type != PLAYERTYPE_1) && ((player_no) == 0) && (aiDebugP1 >= 0))

#define UNK_PLAYER0_CHECK(state, player_no) \
    (((state)->player_type == PLAYERTYPE_1) || UNK_PLAYER0_CHECK2(state, player_no))

typedef struct struct_gameGeom {
    /* 0x0000 */ Mtx mtxBuf[3][0x20];
    /* 0x1800 */ Vtx vtxBuf[3][0x80];
} struct_gameGeom; // size = 0x3000

/**
 * Original name: gameGeom
 */
struct struct_gameGeom *gameGeom;

/**
 * Original name: game_state_data
 */
struct_game_state_data game_state_data[4];

/**
 * Original name: game_map_data
 */
GameMapCell game_map_data[4][GAME_MAP_ROWS * GAME_MAP_COLUMNS];

/**
 * Original name: virus_map_data
 */
struct_virus_map_data virus_map_data[4][16 * 8]; // 16 << 3?

/**
 * Original name: virus_map_disp_order
 */
u8 virus_map_disp_order[4][VIRUS_MAP_DISP_ORDER_LEN];

typedef struct StarForce {
    /* 0x00 */ s32 *xtbl;       /* Original name: xtbl */
    /* 0x04 */ s32 *ytbl;       /* Original name: ytbl */
    /* 0x08 */ s32 frame[0x10]; /* Original name: frame */
} StarForce;                    // size = 0x48

typedef struct ScoreNumsNumbers {
    /* 0x00 */ s32 pos[2]; /* Original name: pos */
    /* 0x08 */ s32 number; /* Original name: number */
    /* 0x0C */ s32 color;  /* Original name: color */
    /* 0x10 */ f32 time;   /* Original name: time */
} ScoreNumsNumbers;        // size = 0x14

typedef struct ScoreNums {
    /* 0x00 */ ScoreNumsNumbers numbers[8]; /* Original name: numbers */
    /* 0xA0 */ s32 index;                   /* Original name: index */
} ScoreNums;                                // size = 0xA4

typedef struct TimeAttackResult {
    /* 0x00 */ s32 level;                          /* Original name: level */
    /* 0x04 */ bool bonus;                         /* Original name: bonus */
    /* 0x08 */ s32 flow; /* Original name: flow */ // TODO: enum?
    /* 0x0C */ s32 frame;                          /* Original name: frame */
    /* 0x10 */ s32 cnt;                            /* Original name: cnt */
    /* 0x14 */ u32 time;                           /* Original name: time */
    /* 0x18 */ s32 combo;                          /* Original name: combo */
    /* 0x1C */ s32 virus;                          /* Original name: virus */
    /* 0x20 */ u32 score;                          /* Original name: score */
    /* 0x24 */ u32 scoreDelta;                     /* Original name: scoreDelta */
    /* 0x28 */ u32 result;                         /* Original name: result */
} TimeAttackResult;                                // size = 0x2C

typedef enum RetryType {
    /* 0x0 */ RETRYTYPE_0,
    /* 0x1 */ RETRYTYPE_1,
    /* 0x2 */ RETRYTYPE_2,
    /* 0x3 */ RETRYTYPE_3,
    /* 0x4 */ RETRYTYPE_4,
    /* 0x5 */ RETRYTYPE_5,
    /* 0x6 */ RETRYTYPE_MAX,
} RetryType;

#define STAR_POS_LEN 12U
#define FRAME_MOVEMENT_MAX 20

typedef struct struct_watchGame {
    /* 0x000 */ bool replayFlag;                                                 /* Original name: replayFlag */
    /* 0x004 */ s32 randSeed;                                                    /* Original name: randSeed */
    /* 0x008 */ s32 randSeed2;                                                   /* Original name: randSeed2 */
    /* 0x00C */ s32 star_pos_x[STAR_POS_LEN]; /* Original name: star_pos_x */    /* Indexed by star_count */
    /* 0x03C */ s32 star_pos_y[STAR_POS_LEN]; /* Original name: star_pos_y */    /* Indexed by star_count */
    /* 0x06C */ s32 star_count;                                                  /* Original name: star_count */
    /* 0x070 */ StarForce starForce;                                             /* Original name: starForce */
    /* 0x0B8 */ ScoreNums scoreNums[MAX_PLAYERS];                                /* Original name: scoreNums */
    /* 0x348 */ s32 retry_type[MAX_PLAYERS]; /* Original name: retry_type */     /* Type: RetryType */
    /* 0x358 */ s32 retry_select[MAX_PLAYERS]; /* Original name: retry_select */ // TODO: enum
    /* 0x368 */ EtcPartIndex retry_result[MAX_PLAYERS];                          /* Original name: retry_result */
    /* 0x378 */ s32 retry_coin;                                                  /* Original name: retry_coin */
    /* 0x37C */ s32 force_draw_capsel_count[MAX_PLAYERS]; /* Original name: force_draw_capsel_count */
    /* 0x38C */ s32 curtain_count;                        /* Original name: curtain_count */
    /* 0x390 */ s32 curtain_step;                         /* Original name: curtain_step */
    /* 0x394 */ s32 frame_move_count;                     /* Original name: frame_move_count */
    /* 0x398 */ s32 frame_move_step;                      /* Original name: frame_move_step */
    /* 0x39C */ s32 face_anime_count[4]; /* unused */     /* Original name: face_anime_count */
    /* 0x3AC */ s32 count_down_ctrl;                      /* Original name: count_down_ctrl */
    /* 0x3B0 */ bool eep_rom_flg;                         /* Original name: eep_rom_flg */
    /* 0x3B4 */ bool bgm_bpm_flg[2];                      /* Original name: bgm_bpm_flg */
    /* 0x3BC */ s32 last_3_se_cnt;                        /* Original name: last_3_se_cnt */
    /* 0x3C0 */ bool last_3_se_flg;                       /* Original name: last_3_se_flg */
    /* 0x3C4 */ bool started_game_flg;                    /* Original name: started_game_flg */
    /* 0x3C8 */ f32 big_virus_wait;                       /* Original name: big_virus_wait */
    /* 0x3CC */ f32 big_virus_timer;                      /* Original name: big_virus_timer */
    /* 0x3D0 */ f32 big_virus_pos[ANIMES_COUNT][2];       /* Original name: big_virus_pos */
    /* 0x3E8 */ f32 big_virus_rot[ANIMES_COUNT];          /* Original name: big_virus_rot */
    /* 0x3F4 */ f32 big_virus_scale[ANIMES_COUNT];        /* Original name: big_virus_scale */
    /* 0x400 */ bool big_virus_flg[ANIMES_COUNT];         /* Original name: big_virus_flg */
    /* 0x40C */ bool big_virus_no_wait;                   /* Original name: big_virus_no_wait */
    /* 0x410 */ s32 big_virus_stop_count;                 /* Original name: big_virus_stop_count */
    /* 0x414 */ s32 big_virus_blink_count; /* Original name: big_virus_blink_count */ /* unused */
    /* 0x418 */ u8 big_virus_count[ANIMES_COUNT];                        /* Original name: big_virus_count */
    /* 0x41C */ s32 demo_timer;                                          /* Original name: demo_timer */
    /* 0x420 */ bool demo_flag;                                          /* Original name: demo_flag */
    /* 0x424 */ s32 blink_count;                                         /* Original name: blink_count */
    /* 0x428 */ s32 warning_se_count;                                    /* Original name: warning_se_count */
    /* 0x42C */ UNUSED_MEMBER(void *objSeg); /* Original name: objSeg */ /* Completely unreferenced */
    /* 0x430 */ TiTexData *texAL; /* Original name: texAL */             // TODO: make enums to index these bunch
    /* 0x434 */ TiTexData *texLS;                                        /* Original name: texLS */
    /* 0x438 */ TiTexData *texP1;                                        /* Original name: texP1 */
    /* 0x43C */ TiTexData *texP2;                                        /* Original name: texP2 */
    /* 0x440 */ TiTexData *texP4;                                        /* Original name: texP4 */
    /* 0x444 */ TiTexData *texItem;                                      /* Original name: texItem */
    /* 0x448 */ TiTexData *texKaSa;                                      /* Original name: texKaSa */
    /* 0x44C */ SAnimeState virus_anime_state[ANIMES_COUNT];             /* Original name: virus_anime_state */
    /* 0x50C */ SAnimeSmog virus_smog_state[ANIMES_COUNT];               /* Original name: virus_smog_state */
    /* 0x878 */ s32 graphic_thread_pri;                                  /* Original name: graphic_thread_pri */
    /* 0x87C */ u16 *bg_snap_buf;                                        /* Original name: bg_snap_buf */
    /* 0x880 */ bool bg_snapping;                                        /* Original name: bg_snapping */
    /* 0x884 */ void *gameEtcSeg;                                        /* Original name: effect_data_buf */
    /* 0x888 */ s32 effect_timer[MAX_PLAYERS];                           /* Original name: effect_timer */
    /* 0x898 */ s32 touch_down_wait;                                     /* Original name: touch_down_wait */
    /* 0x89C */ s32 win_count[TEAMNUMBER_MAX];
    /* Original name: win_count */ /* Indexed by TeamNumber/`struct_game_state_data::team_no` */
    /* 0x8AC */ s32 vs_win_count[EVS_SELECT_NAME_NO_COUNT]; /* Original name: vs_win_count */
    /* 0x8B4 */ s32 vs_win_total[2];                        /* Original name: vs_win_total */
    /* 0x8BC */ s32 vs_4p_player_count;                     /* Original name: vs_4p_player_count */
    /* 0x8C0 */ bool vs_4p_team_flg;                        /* Original name: vs_4p_team_flg */
    /* 0x8C4 */ u32 vs_4p_team_bits[2];                     /* Original name: vs_4p_team_bits */
    /* 0x8CC */ s32 story_4p_name_num[TEAMNUMBER_MAX];
    /* Original name: story_4p_name_num */ // Indexed by TeamNumber/`struct_game_state_data::team_no`
    /* 0x8DC */ s32 story_4p_stock_cap[TEAMNUMBER_MAX][4];
    /* Original name: story_4p_stock_cap */ // Outer indexed by TeamNumber/`struct_game_state_data::team_no`
    /* 0x91C */ MessageWnd msgWnd;          /* Original name: msgWnd */
    /* 0x99C */ s32 coin_count;             /* Original name: coin_count */
    /* 0x9A0 */ s32 coin_time[3];           /* Original name: coin_time */
    /* 0x9AC */ s32 coffee_break_flow; /* Original name: coffee_break_flow */   // TODO: enum?
    /* 0x9B0 */ s32 coffee_break_timer;                                         /* Original name: coffee_break_timer */
    /* 0x9B4 */ s32 coffee_break_level; /* Original name: coffee_break_level */ // TODO: enum
    /* 0x9B8 */ s32 coffee_break_shard; /* Original name: coffee_break_shard */ // TODO: enum
    /* 0x9BC */ bool bottom_up_flag;                                            /* Original name: bottom_up_flag */
    /* 0x9C0 */ bool query_play_pause_se;                                       /* Original name: query_play_pause_se */
    /* 0x9C4 */ s32 query_pause_player_no;            /* Original name: query_pause_player_no */
    /* 0x9C8 */ s32 query_debug_player_no;            /* Original name: query_debug_player_no */
    /* 0x9CC */ s32 query_config_player_no;           /* Original name: query_config_player_no */
    /* 0x9D0 */ TimeAttackResult timeAttackResult[2]; /* Original name: timeAttackResult */
    /* 0xA28 */ MessageWnd passWnd;                   /* Original name: passWnd */
    /* 0xAA8 */ s32 passAlphaStep;                    /* Original name: passWnd */
    /* 0xAAC */ unsigned char passBuf[42];            /* Original name: passBuf */
    /* 0xAD8 */ RecordWritingMessage writingMsg;      /* Original name: writingMsg */
} struct_watchGame;                                   // size = 0xB60

/**
 * Original name: watchGame
 */
struct_watchGame *watchGame;

/**
 * Original name: evs_gamemode
 */
enum_evs_gamemode evs_gamemode;

/**
 * Original name: CapsMagazine
 */
u8 CapsMagazine[0x100];

typedef struct GameStateBackup {
    /* 0x0000 */ struct_watchGame game;                                          /* Original name: game */
    /* 0x0B60 */ struct_game_state_data state[MAX_PLAYERS];                      /* Original name: state */
    /* 0x1A70 */ GameMapCell map[MAX_PLAYERS][GAME_MAP_ROWS * GAME_MAP_COLUMNS]; /* Original name: map */
    /* 0x2FB0 */ s32 highScore;                                                  /* Original name: highScore */
    /* 0x2FB4 */ s32 gameTime;                                                   /* Original name: gameTime */
} GameStateBackup;                                                               // size = 0x2FB8

/**
 * Original name: gameBackup
 */
GameStateBackup *gameBackup[2];

/**
 * Original name: heapTop
 */
static void *heapTop;

u8 virus_anime_table[3][4] = {
    { 7, 8, 0x10, 0x11 },
    { 9, 0xA, 0x12, 0x13 },
    { 0xB, 0xC, 0x14, 0x15 },
};
s8 dm_chaine_se_table_vs_178[4] = {
    SND_INDEX_59,
    SND_INDEX_75,
    SND_INDEX_0,
    SND_INDEX_0,
};
s8 dm_chaine_se_table_4p_179[4][3] = {
    { SND_INDEX_77, SND_INDEX_76, SND_INDEX_75 },
    { SND_INDEX_59, SND_INDEX_77, SND_INDEX_76 },
    { SND_INDEX_75, SND_INDEX_59, SND_INDEX_77 },
    { SND_INDEX_76, SND_INDEX_75, SND_INDEX_59 },
};
s32 rotate_table_474[4] = { 1, 3, 4, 2 };
s32 rotate_mtx_475[6] = { 2, 0, 3, 1, 2, 0 };
bool dm_think_flg = false;
bool visible_fall_point[4] = {
#if VERSION_US
    true,
    true,
    true,
    true,
#elif VERSION_GW || VERSION_CN
    false,
    false,
    false,
    false,
#else
#error ""
#endif
};

#ifdef NN_SC_PERF
s32 D_800BEF08_cn = 0;
#endif

/**
 * Original name: dm_calc_score
 */
u32 dm_calc_score(struct_game_state_data *state, s32 level) {
    u32 score = 0;
    s32 i;

    for (i = state->erase_virus_count_old; i < state->erase_virus_count; i++) {
        s32 var_v1 = MIN(i, ARRAY_COUNT(Score1p[level]) - 1);

        score += Score1p[level][var_v1] * 100;
    }

    state->erase_virus_count_old = state->erase_virus_count;
    return score;
}

/**
 * Original name: dm_add_score
 */
void dm_add_score(struct_game_state_data *state, u32 score) {
    state->game_score += score;
    if (state->game_score > 9999900) {
        state->game_score = 9999900;
    }

    if (evs_high_score < state->game_score) {
        evs_high_score = state->game_score;
    }
}

/**
 * Original name: dm_make_score
 */
u32 dm_make_score(struct_game_state_data *state) {
    s32 score;
    s32 level;

    if (evs_story_flg != 0) {
        if (evs_story_level < 3) {
            level = evs_story_level;
        } else {
            level = 2;
        }
    } else {
        switch (evs_gamesel) {
            case GSL_1PLAY:
                level = state->cap_def_speed;
                break;

            case GSL_2PLAY:
                level = state->cap_def_speed;
                break;

            case GSL_4PLAY:
                level = state->cap_def_speed;
                break;

            case GSL_VSCPU:
                level = state->cap_def_speed;
                break;

            case GSL_1DEMO:
                level = state->cap_def_speed;
                break;

            case GSL_2DEMO:
                level = state->cap_def_speed;
                break;

            case GSL_4DEMO:
                level = state->cap_def_speed;
                break;

            default:
                break;
        }
    }

    score = dm_calc_score(state, level);
    dm_add_score(state, score);
    return score;
}

/**
 * Original name: dm_attack_se
 */
void dm_attack_se(struct_game_state_data *state, s32 player_no) {
    s32 i;

    if (state->chain_line < 2) {
        return;
    }

    switch (evs_gamesel) {
        case GSL_1PLAY:
            dm_snd_play_in_game(SND_INDEX_59);
            break;

        case GSL_2PLAY:
        case GSL_VSCPU:
            dm_snd_play_in_game(dm_chaine_se_table_vs_178[player_no]);
            break;

        case GSL_4PLAY:
            for (i = 0; i < ARRAY_COUNT(dm_chaine_se_table_4p_179[player_no]); i++) {
                if ((state->chain_color[3] >> i) & 1) {
                    dm_snd_play_in_game(dm_chaine_se_table_4p_179[player_no][i]);
                }
            }
            break;

        default:
            break;
    }
}

/**
 * Original name: dm_warning_h_line
 */
void dm_warning_h_line(struct_game_state_data *state, GameMapCell *map) {
    bool flg = false;
    s32 row;

    for (row = 1; row < 4; row++) {
        s32 column;

        for (column = 0; column < GAME_MAP_COLUMNS; column++) {
            if (get_map_info(map, column, row) == true) {
                flg = true;
                break;
            }
        }

        if (flg) {
            break;
        }
    }

    if (flg) {
        if (!state->warning_se_flag) {
            state->warning_se_flag = true;
        }
    } else {
        state->warning_se_flag = false;
    }
}

/**
 * Original name: set_down_flg
 */
bool set_down_flg(GameMapCell *map) {
    bool flg[2];
    s32 i;
    s32 j;
    bool ret;
    u32 l;

    for (i = 0; i < (GAME_MAP_ROWS - 2) * GAME_MAP_COLUMNS; i++) {
        map[i].capsel_m_flg[1] = 1;
    }

    for (j = GAME_MAP_ROWS - 3; j >= 0; j--) {
        for (i = 0; i < GAME_MAP_COLUMNS; i++) {
            u32 index = GAME_MAP_GET_INDEX(j, i);

            if ((map + index)->capsel_m_flg[0] == 0) {
                (map + index)->capsel_m_flg[1] = 0;
                continue;
            }

            if ((map + index)->capsel_m_flg[4] >= 0) {
                (map + index)->capsel_m_flg[1] = 0;
                continue;
            }

            if (((map + index)->capsel_m_g == 2) || ((map + index)->capsel_m_g == 3)) {
                if ((map + index)->capsel_m_g == 2) {
                    for (l = 0; l < 2; l++) {
                        flg[l] = true;
                        if (get_map_info(map, (map + index + l)->pos_m_x, (map + index + l)->pos_m_y + 1) == 1) {
                            if ((map + index + l + GAME_MAP_COLUMNS)->capsel_m_flg[1] != 1) {
                                flg[l] = false;
                            }
                        }
                    }

                    if (!flg[0] || !flg[1]) {
                        for (l = 0; l < 2; l++) {
                            (map + index + l)->capsel_m_flg[1] = 0;
                        }
                    }
                } else if ((map + index)->capsel_m_g == 3) {
                    for (l = 0; l < 2; l++) {
                        flg[l] = true;
                        if (get_map_info(map, (map + index - l)->pos_m_x, (map + index - l)->pos_m_y + 1) == 1) {
                            if ((map + index - l + GAME_MAP_COLUMNS)->capsel_m_flg[1] != 1) {
                                flg[l] = false;
                            }
                        }
                    }

                    if (!flg[0] || !flg[1]) {
                        for (l = 0; l < 2; l++) {
                            (map + index - l)->capsel_m_flg[1] = 0;
                        }
                    }
                }
            } else if (get_map_info(map, (map + index)->pos_m_x, (map + index)->pos_m_y + 1) == 1) {
                if ((map + index + GAME_MAP_COLUMNS)->capsel_m_flg[1] != 1) {
                    (map + index)->capsel_m_flg[1] = 0;
                }
            }
        }
    }

    for (i = ret = 0; i < (GAME_MAP_ROWS - 1) * GAME_MAP_COLUMNS; i++) {
        if ((map[i].capsel_m_flg[0] != 0) && (map[i].capsel_m_flg[1] != 0)) {
            ret++;
        }
    }

    return ret;
}

/**
 * Original name: go_down
 */
void go_down(struct_game_state_data *state, GameMapCell *map, s32 cout) {
    bool se_flg = false;
    s32 i;
    s32 j;

    state->erase_anime_count++;
    if (state->erase_anime_count < cout) {
        return;
    }

    state->erase_anime_count = 0;

    for (i = GAME_MAP_ROWS - 1; i >= 0; i--) {
        for (j = 0; j < GAME_MAP_COLUMNS; j++) {
            s32 index = GAME_MAP_GET_INDEX(i, j);

            if (map[index].capsel_m_flg[1] != 0) {
                set_map(map, map[index].pos_m_x, map[index].pos_m_y + 1, map[index].capsel_m_g, map[index].capsel_m_p);
                clear_map(map, map[index].pos_m_x, map[index].pos_m_y);
                se_flg = true;
            }
        }
    }

    if (se_flg) {
        dm_snd_play_in_game(SND_INDEX_55);
    }

    if (state->flg_game_over && (state->cnd_training == dm_cnd_training)) {
        for (j = 0; j < (GAME_MAP_ROWS - 1) * GAME_MAP_COLUMNS; j++) {
            if ((map[j].capsel_m_flg[0] != 0) && (map[j].capsel_m_flg[1] == 0) && (map[j].capsel_m_p < 3)) {
                map[j].capsel_m_p += 3;
            }
        }
    }

    if (set_down_flg(map) == 0) {
        if (dm_h_erase_chack(map) || dm_w_erase_chack(map)) {
            if (!state->flg_game_over) {
                state->mode_now = dm_mode_erase_chack;
            } else {
                state->mode_now = dm_mode_tr_erase_chack;
            }
            state->cap_speed_count = 0;
        } else {
            if (!state->flg_game_over) {
                state->mode_now = dm_mode_cap_set;
            } else {
                state->mode_now = dm_mode_tr_cap_set;
            }
        }
    }
}

/**
 * Original name: erase_anime
 */
void erase_anime(GameMapCell *map) {
    s32 i;

    for (i = 0; i < (GAME_MAP_ROWS - 1) * GAME_MAP_COLUMNS; i++) {
        GameMapCell *cell = &map[i];

        if ((cell->capsel_m_flg[0] != 0) && (cell->capsel_m_flg[2] != 0)) {
            cell->capsel_m_g++;

            if (cell->capsel_m_flg[4] >= 0) {
                if (cell->capsel_m_g >= 0xF) {
                    clear_map(map, cell->pos_m_x, cell->pos_m_y);
                }
            } else {
                if (cell->capsel_m_g >= 7) {
                    clear_map(map, cell->pos_m_x, cell->pos_m_y);
                }
            }
        }
    }
}

/**
 * Original name: rotate_table_399
 */
const s32 rotate_table_399[] = {
    1,
    3,
    4,
    2,
};

/**
 * Original name: rotate_mtx_400
 */
const s32 rotate_mtx_400[] = {
    2, 0, 3, 1, 2, 0,
};

/**
 * Original name: throw_rotate_capsel
 */
void throw_rotate_capsel(struct_game_state_data_now_cap *cap) {
    s32 i;
    s32 vec;
    s32 save;

    if (cap->pos_x[0] == cap->pos_x[1]) {
        cap->pos_x[1]++;
        cap->pos_y[1]++;

        save = cap->capsel_p[0];
        cap->capsel_p[0] = cap->capsel_p[1];
        cap->capsel_p[1] = save;

        vec = 1;
    } else {
        cap->pos_x[1]--;
        cap->pos_y[1]--;
        vec = -1;
    }

    for (i = 0; i < ARRAY_COUNT(cap->casel_g); i++) {
        save = rotate_table_399[cap->casel_g[i]];
        save += vec;

        cap->casel_g[i] = rotate_mtx_400[save];
    }
}

/**
 * Original name: translate_capsel
 */
void translate_capsel(GameMapCell *map, struct_game_state_data *state, s32 move_vec, s32 joy_no) {
    s32 vec = 0;
    struct_game_state_data_now_cap *temp_s5 = &state->now_cap;

    if ((temp_s5->pos_y[0] <= 0) || (temp_s5->capsel_flg_0 == 0)) {
        return;
    }

    if (move_vec == 1) {
        if (temp_s5->pos_x[0] == temp_s5->pos_x[1]) {
            if ((temp_s5->pos_x[1] < 7) && (get_map_info(map, temp_s5->pos_x[1] + 1, temp_s5->pos_y[0]) != move_vec)) {
                if (temp_s5->pos_y[1] == 0) {
                    vec = 1;
                } else if (get_map_info(map, temp_s5->pos_x[0] + 1, temp_s5->pos_y[1]) != move_vec) {
                    vec = 1;
                }
            }
        } else if (temp_s5->pos_x[1] < 7) {
            if (get_map_info(map, temp_s5->pos_x[1] + 1, temp_s5->pos_y[0]) != move_vec) {
                vec = 1;
            }
        }
    } else if (move_vec == -1) {
        if (temp_s5->pos_x[0] == temp_s5->pos_x[1]) {
            if ((temp_s5->pos_x[0] > 0) && (get_map_info(map, temp_s5->pos_x[0] - 1, temp_s5->pos_y[0]) != 1)) {
                if (temp_s5->pos_y[1] == 0) {
                    vec = -1;
                } else if (get_map_info(map, temp_s5->pos_x[0] - 1, temp_s5->pos_y[1]) != 1) {
                    vec = -1;
                }
            }
        } else if (temp_s5->pos_x[0] > 0) {
            if (get_map_info(map, temp_s5->pos_x[0] - 1, temp_s5->pos_y[0]) != 1) {
                vec = -1;
            }
        }
    }

    if (vec != 0) {
        dm_snd_play_in_game(SND_INDEX_65);
        state->cap_move_se_flg = false;
        temp_s5->pos_x[0] += vec;
        temp_s5->pos_x[1] += vec;
    } else {
        if (!state->cap_move_se_flg) {
            state->cap_move_se_flg = true;
            dm_snd_play_in_game(SND_INDEX_65);
        }

        if (move_vec == 1) {
            joyCursorFastSet(R_JPAD, joy_no);
        } else if (move_vec == -1) {
            joyCursorFastSet(L_JPAD, joy_no);
        }
    }
}

/**
 * Original name: rotate_capsel
 */
void rotate_capsel(GameMapCell *map, struct_game_state_data_now_cap *cap, s32 move_vec) {
    s32 vec = 0;
    s32 save;

    if ((cap->pos_y[0] <= 0) || (cap->capsel_flg_0 == 0)) {
        return;
    }

    if (cap->pos_x[0] == cap->pos_x[1]) {
        if ((cap->pos_x[0] == 7) || (get_map_info(map, cap->pos_x[0] + 1, cap->pos_y[0]) == 1)) {
            if ((cap->pos_x[0] != 0) && (get_map_info(map, cap->pos_x[0] - 1, cap->pos_y[0]) != 1)) {
                cap->pos_x[0]--;
                vec = 1;
            }
        } else {
            cap->pos_x[1]++;
            vec = 1;
        }

        if (vec != 0) {
            cap->pos_y[1]++;
            if (move_vec == -1) {
                save = cap->capsel_p[0];
                cap->capsel_p[0] = cap->capsel_p[1];
                cap->capsel_p[1] = save;
            }
        }
    } else {
        if (cap->pos_y[0] == 1) {
            cap->pos_x[1]--;
            vec = -1;
        } else if (get_map_info(map, cap->pos_x[0], cap->pos_y[0] - 1) == 1) {
            if (get_map_info(map, cap->pos_x[0] + 1, cap->pos_y[0] - 1) != 1) {
                cap->pos_x[0]++;
                vec = -1;
            }
        } else {
            cap->pos_x[1]--;
            vec = -1;
        }

        if (vec != 0) {
            cap->pos_y[1]--;
            if (move_vec == 1) {
                save = cap->capsel_p[0];
                cap->capsel_p[0] = cap->capsel_p[1];
                cap->capsel_p[1] = save;
            }
        }
    }

    if (vec != 0) {
        s32 i;

        dm_snd_play_in_game(SND_INDEX_67);

        for (i = 0; i < ARRAY_COUNTU(cap->casel_g); i++) {
            save = rotate_table_474[cap->casel_g[i]];
            save += vec;
            cap->casel_g[i] = rotate_mtx_475[save];
        }
    }
}

#define CAPSMAGAZINE_GET_A(mag) (((mag) >> 4) % 3)
#define CAPSMAGAZINE_GET_B(mag) ((mag) % 3)

/**
 * Original name: dm_make_magazine
 */
void dm_make_magazine(void) {
    u8 sp18[2];
    s32 i;

    CapsMagazine[0] = random(0xFFFF) % ARRAY_COUNT(CapsMagazine);

    sp18[0] = CAPSMAGAZINE_GET_A(CapsMagazine[0]);
    sp18[1] = CAPSMAGAZINE_GET_B(CapsMagazine[0]);

    i = 1;
    while (i < ARRAY_COUNT(CapsMagazine)) {
        u8 sp20[2];

        CapsMagazine[i] = random(0xFFFF) % ARRAY_COUNT(CapsMagazine);

        sp20[0] = CAPSMAGAZINE_GET_A(CapsMagazine[i]);
        sp20[1] = CAPSMAGAZINE_GET_B(CapsMagazine[i]);

        if ((sp20[0] != sp18[0]) || sp20[1] != sp18[1]) {
            i++;
            sp18[0] = sp20[0];
            sp18[1] = sp20[1];
        }
    }
}

/**
 * Original name: dm_init_capsel
 */
void dm_init_capsel(struct_game_state_data_now_cap *cap, u32 left_cap_col, u32 right_cap_col) {
    cap->pos_x[0] = 3;
    cap->pos_x[1] = 4;
    cap->pos_y[1] = 0;
    cap->pos_y[0] = 0;
    cap->casel_g[0] = 2;
    cap->casel_g[1] = 3;
    cap->capsel_p[0] = left_cap_col;
    cap->capsel_p[1] = right_cap_col;
    cap->capsel_flg_0 = 1;
    cap->capsel_flg_2 = 0;
    cap->capsel_flg_1 = 0;
}

/**
 * Original name: dm_init_capsel_go
 */
void dm_init_capsel_go(struct_game_state_data_now_cap *cap, s32 left_cap_col, s32 right_cap_col) {
    dm_init_capsel(cap, left_cap_col, right_cap_col);
    cap->capsel_flg_1 = 1;
}

/**
 * Original name: dm_set_capsel
 */
void dm_set_capsel(struct_game_state_data *state) {
    state->cap_move_se_flg = false;

    dm_init_capsel_go(&state->now_cap, CAPSMAGAZINE_GET_A(CapsMagazine[state->cap_magazine_cnt]),
                      CAPSMAGAZINE_GET_B(CapsMagazine[state->cap_magazine_cnt]));
    state->cap_magazine_save = state->cap_magazine_cnt;

    state->cap_magazine_cnt++;
    if (state->cap_magazine_cnt >= 254) {
        state->cap_magazine_cnt = 1;
    }

    dm_init_capsel(&state->next_cap, CAPSMAGAZINE_GET_A(CapsMagazine[state->cap_magazine_cnt]),
                   CAPSMAGAZINE_GET_B(CapsMagazine[state->cap_magazine_cnt]));
}

/**
 * Original name: _speed_561
 */
const u8 _speed_561[] = {
    0x0F,
    0x14,
    0x19,
};

/**
 * Original name: dm_capsel_speed_up
 */
void dm_capsel_speed_up(struct_game_state_data *state) {
    state->cap_count++;
    if (state->cap_count >= 10) {
        u8 temp;

        dm_snd_play_in_game(SND_INDEX_58);
        state->cap_count = 0;

        state->cap_speed++;
        temp = GameSpeed[3];
        if (temp < state->cap_speed) {
            state->cap_speed = temp;
        }
    }

    if (evs_gamemode == GMD_TaiQ) {
        state->cap_speed = MIN(_speed_561[state->game_level], state->cap_speed);
    }
}

/**
 * Original name: dm_check_game_over
 */
bool dm_check_game_over(struct_game_state_data *state, GameMapCell *map UNUSED) {
    if (state->cnd_static == dm_cnd_game_over) {
        return true;
    }
    return false;
}

/**
 * Original name: update_flash_virus_count
 */
s32 update_flash_virus_count(struct_game_state_data *state, GameMapCell *map, bool flag) {
    s32 count = 0;
    s32 i;

    for (i = 0; i < state->flash_virus_count; i++) {
        s32 index = GAME_MAP_GET_INDEX_ALT(state->flash_virus_pos[i].row, state->flash_virus_pos[i].column);

        if (((map[index].capsel_m_flg[0] == 0) || (map[index].capsel_m_flg[2] != 0) ||
             (map[index].capsel_m_flg[4] < 0))) {
            if (flag) {
                state->flash_virus_pos[i].color = -1;
            }
        } else {
            count++;
        }
    }

    return count;
}

/**
 * Original name: dm_update_virus_count
 */
s32 dm_update_virus_count(struct_game_state_data *state, GameMapCell *map, bool flag) {
    if (evs_gamemode == GMD_FLASH) {
        state->virus_number = update_flash_virus_count(state, map, flag);
    } else {
        state->virus_number = get_virus_count(map);
    }

    return state->virus_number;
}

/**
 * Original name: dm_set_virus
 */
void dm_set_virus(struct_game_state_data *state, GameMapCell *map, struct_virus_map_data *v_map,
                  u8 order[VIRUS_MAP_DISP_ORDER_LEN]) {
    s32 virus_max;

    if (state->cnd_now != dm_cnd_init) {
        return;
    }

    virus_max = dm_get_first_virus_count(evs_gamemode, state);

    if (state->virus_order_number < virus_max) {
        while (state->virus_order_number < virus_max) {
            if (!(order[state->virus_order_number] & 0x80)) {
                break;
            }
            state->virus_order_number++;
        }

        if (state->virus_order_number < virus_max) {
            u8 cellIndex = order[state->virus_order_number];

            order[state->virus_order_number] |= 0x80;

            set_virus(map, v_map[cellIndex].x_pos, v_map[cellIndex].y_pos, v_map[cellIndex].virus_type,
                      virus_anime_table[v_map[cellIndex].virus_type][state->virus_anime]);
            if (state->cnd_training == dm_cnd_training) {
                map[cellIndex].capsel_m_p += 3;
            }
        }
    }

    if (state->virus_order_number >= virus_max) {
        state->cnd_now = dm_cnd_wait;
        state->mode_now = dm_mode_wait;
    }

    dm_update_virus_count(state, map, false);
}

/**
 * Original name: dm_virus_anime
 */
void dm_virus_anime(struct_game_state_data *state, GameMapCell *map) {
    s32 index;

    state->virus_anime_count++;
    if (state->virus_anime_spead >= state->virus_anime_count) {
        return;
    }

    state->virus_anime_count = 0;

    state->virus_anime += state->virus_anime_vec;
    if (state->virus_anime_max < state->virus_anime) {
        state->virus_anime_vec = -1;
    } else if (state->virus_anime == 0) {
        state->virus_anime_vec = 1;
    }

    for (index = 0; index < (GAME_MAP_ROWS - 1) * GAME_MAP_COLUMNS; index++) {
        if ((map[index].capsel_m_flg[0] != 0) && (map[index].capsel_m_flg[2] == 0)) {
            if (map[index].capsel_m_flg[4] >= 0) {
                map[index].capsel_m_g = virus_anime_table[map[index].capsel_m_flg[4]][state->virus_anime];
            }
        }
    }
}

/**
 * Original name: dm_capsel_erase_anime
 */
void dm_capsel_erase_anime(struct_game_state_data *state, GameMapCell *map) {
    state->erase_anime_count++;

    if (state->erase_anime_count == 10) {
        erase_anime(map);
        state->erase_anime++;
    } else if (state->erase_anime_count > 26) {
        erase_anime(map);
        set_down_flg(map);
        state->erase_anime = 0;
        state->mode_now = dm_mode_ball_down;
        state->erase_anime_count = 14;
    }
}

/**
 * Original name: dm_make_erase_h_line
 */
void dm_make_erase_h_line(struct_game_state_data *state, GameMapCell *map, s32 rowStart, s32 count, s32 column) {
    s32 row;

    for (row = rowStart; row < rowStart + count + 1; row++) {
        s32 index = GAME_MAP_GET_INDEX(row, column);

        if (map[index].capsel_m_flg[2] == 1) {
            continue;
        }

        map[index].capsel_m_flg[2] = 1;

        if (map[index].capsel_m_flg[4] < 0) {
            map[index].capsel_m_g = 5;
        } else {
            map[index].capsel_m_g = 0xD;
            state->erase_virus_count++;
            state->chain_color[3] |= 8;
            state->chain_color[3] |= (0x10 << map[index].capsel_m_flg[3]);
        }
    }
}

/**
 * Original name: dm_h_erase_chack
 */
bool dm_h_erase_chack(GameMapCell *map) {
    s32 column;

    for (column = 0; column < GAME_MAP_COLUMNS; column++) {
        s32 row;
        s32 val = 0xF;
        s32 var_a1 = 0;
        s32 var_a3 = -1;

        for (row = 0; row < GAME_MAP_ROWS - 1; row++) {
            if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[0] != 0) {
                if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[3] != var_a3) {
                    if (var_a1 < 3) {
                        if (row >= 0xD) {
                            break;
                        }
                        var_a3 = map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[3];
                        var_a1 = 0;
                    } else {
                        return true;
                    }
                } else {
                    var_a1++;
                    if (row == val) {
                        if (var_a1 >= 3) {
                            return true;
                        }
                    }
                }
            } else if (var_a1 >= 3) {
                return true;
            } else if (row < 13) {
                var_a1 = 0;
                var_a3 = -1;
            } else {
                break;
            }
        }
    }

    return false;
}

/**
 * Original name: dm_h_erase_chack_set
 */
void dm_h_erase_chack_set(struct_game_state_data *state, GameMapCell *map) {
    s32 column;

    for (column = 0; column < GAME_MAP_COLUMNS; column++) {
        s32 var_s1 = 0;
        s32 var_s5 = -1;
        s32 var_s2 = -1;
        s32 var_fp = 0;
        s32 row;

        for (row = 0; row < GAME_MAP_ROWS - 1; row++) {
            if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[0] != 0) {
                if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[3] != var_s2) {
                    if (var_s1 >= 3) {
                        dm_make_erase_h_line(state, map, var_s5, var_s1, column);
                        if (state->chain_count == 0) {
                            state->chain_color[3] |= (1 << var_s2);
                        }
                        state->chain_color[var_s2]++;
                        state->chain_line++;
                    }

                    if (row < 0xD) {
                        var_s5 = row;
                        var_s2 = map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[3];
                        var_s1 = 0;
                    } else {
                        var_fp = 1;
                    }
                } else {
                    var_s1++;
                    if (row == 15) {
                        if (var_s1 >= 3) {
                            dm_make_erase_h_line(state, map, var_s5, var_s1, column);
                            if (state->chain_count == 0) {
                                state->chain_color[3] |= (1 << var_s2);
                            }
                            state->chain_color[var_s2]++;
                            state->chain_line++;
                        }
                    }
                }
            } else {
                if (var_s1 >= 3) {
                    dm_make_erase_h_line(state, map, var_s5, var_s1, column);
                    if (state->chain_count == 0) {
                        state->chain_color[3] |= (1 << var_s2);
                    }
                    state->chain_color[var_s2]++;
                    state->chain_line++;
                }

                if (row >= 13) {
                    var_fp = 1;
                } else {
                    var_s1 = 0;
                    var_s5 = -1;
                    var_s2 = -1;
                }
            }

            if (var_fp != 0) {
                break;
            }
        }
    }
}

/**
 * Original name: dm_make_erase_w_line
 */
void dm_make_erase_w_line(struct_game_state_data *state, GameMapCell *map, s32 columnStart, s32 chain, s32 row) {
    s32 column = columnStart;
    u32 columnEnd = column + chain + 1;

    for (; column < columnEnd; column++) {
        s32 index = GAME_MAP_GET_INDEX(row, column);

        if (map[index].capsel_m_flg[2] != 1) {
            map[index].capsel_m_flg[2] = 1;

            if (map[index].capsel_m_flg[4] < 0) {
                map[index].capsel_m_g = 5;
            } else {
                map[index].capsel_m_g = 0xD;
                state->erase_virus_count++;
                state->chain_color[3] |= 8;
                state->chain_color[3] |= (0x10 << map[index].capsel_m_flg[3]);
            }
        }
    }
}

/**
 * Original name: dm_w_erase_chack
 */
bool dm_w_erase_chack(GameMapCell *map) {
    s32 row;

    for (row = 0; row < GAME_MAP_ROWS - 1; row++) {
        s32 var_a1 = 0;
        s32 var_a3 = -1;
        s32 column;

        for (column = 0; column < GAME_MAP_COLUMNS; column++) {
            if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[0] != 0) {
                if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[3] != var_a3) {
                    if (var_a1 >= 3) {
                        return true;
                    } else if (column < 5) {
                        var_a3 = map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[3];
                        var_a1 = 0;
                    } else {
                        break;
                    }
                } else {
                    var_a1++;
                    if (column == 7) {
                        if (var_a1 >= 3) {
                            return true;
                        }
                    }
                }
            } else if (var_a1 >= 3) {
                return true;
            } else if (column < 5) {
                var_a1 = 0;
                var_a3 = -1;
            } else {
                break;
            }
        }
    }
    return false;
}

/**
 * Original name: dm_w_erase_chack_set
 */
void dm_w_erase_chack_set(struct_game_state_data *state, GameMapCell *map) {
    s32 row;

    for (row = 0; row < GAME_MAP_ROWS - 1; row++) {
        s32 column;
        s32 chain = 0;
        s32 chain_start = -1;
        s32 chain_col = -1;
        bool var_fp = false;

        for (column = 0; column < GAME_MAP_COLUMNS; column++) {
            u32 index = GAME_MAP_GET_INDEX(row, column);

            if (map[index].capsel_m_flg[0] != 0) {
                if (map[index].capsel_m_flg[3] != chain_col) {
                    if (chain >= 3) {
                        dm_make_erase_w_line(state, map, chain_start, chain, row);
                        if (state->chain_count == 0) {
                            state->chain_color[3] |= 1 << chain_col;
                        }
                        state->chain_color[chain_col]++;
                        state->chain_line++;
                    }
                    if (column >= 5) {
                        var_fp = true;
                    } else {
                        chain_start = column;
                        chain_col = map[index].capsel_m_flg[3];
                        chain = 0;
                    }
                } else {
                    chain++;
                    if (column == 7) {
                        if (chain >= 3) {
                            dm_make_erase_w_line(state, map, chain_start, chain, row);
                            if (state->chain_count == 0) {
                                state->chain_color[3] |= 1 << chain_col;
                            }
                            state->chain_color[chain_col]++;
                            state->chain_line++;
                        }
                    }
                }
            } else {
                if (chain >= 3) {
                    dm_make_erase_w_line(state, map, chain_start, chain, row);
                    if (state->chain_count == 0) {
                        state->chain_color[3] |= 1 << chain_col;
                    }
                    state->chain_color[chain_col]++;
                    state->chain_line++;
                }

                if (column >= 5) {
                    var_fp = true;
                } else {
                    chain = 0;
                    chain_start = -1;
                    chain_col = -1;
                }
            }

            if (var_fp) {
                break;
            }
        }
    }
}

/**
 * Original name: dm_h_ball_chack
 */
void dm_h_ball_chack(GameMapCell *map) {
    u32 column;

    for (column = 0; column < GAME_MAP_COLUMNS; column++) {
        u32 row;

        for (row = 0; row < GAME_MAP_ROWS - 1; row++) {
            s32 index = GAME_MAP_GET_INDEX(row, column);
            s32 temp;

            if (map[index].capsel_m_flg[0] == 0) {
                continue;
            }

            if (map[index].capsel_m_g == 0) {
                temp = GAME_MAP_GET_INDEX(row + 1, column);
                if (map[temp].capsel_m_g != 1) {
                    map[index].capsel_m_g = 4;
                }
            } else if (map[index].capsel_m_g == 1) {
                if (map[index].pos_m_y == 1) {
                    map[index].capsel_m_g = 4;
                } else {
                    temp = GAME_MAP_GET_INDEX(row - 1, column);
                    if (map[temp].capsel_m_g != 0) {
                        map[index].capsel_m_g = 4;
                    }
                }
            }
        }
    }
}

/**
 * Original name: dm_w_ball_chack
 */
void dm_w_ball_chack(GameMapCell *map) {
    u32 row;

    for (row = 0; row < GAME_MAP_ROWS - 1; row++) {
        u32 column;

        for (column = 0; column < GAME_MAP_COLUMNS; column++) {
            if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_flg[0] != 0) {
                if (map[GAME_MAP_GET_INDEX(row, column)].capsel_m_g == 2) {
                    if (map[GAME_MAP_GET_INDEX(row, column + 1)].capsel_m_g != 3) {
                        map[GAME_MAP_GET_INDEX(row, column)].capsel_m_g = 4;
                    }
                } else if ((map[GAME_MAP_GET_INDEX(row, column)].capsel_m_g == 3) &&
                           (map[GAME_MAP_GET_INDEX(row, column - 1)].capsel_m_g != 2)) {
                    map[GAME_MAP_GET_INDEX(row, column)].capsel_m_g = 4;
                }
            }
        }
    }
}

/**
 * Original name: dm_black_up
 */
bool dm_black_up(struct_game_state_data *state, GameMapCell *map) {
    if (state->flg_retire && !state->flg_game_over) {
        state->erase_anime_count++;
        if (state->erase_anime_count >= 6U) {
            u8 temp;
            u8 column;

            state->erase_anime_count = 0;
            temp = ((state->black_up_count - 1) * GAME_MAP_COLUMNS);

            for (column = 0; column < GAME_MAP_COLUMNS; column++) {
                // hate this
                if ((map + temp + column)->capsel_m_flg[0] != 0) {
                    (map + temp + column)->capsel_m_p += 3;
                }
            }

            state->black_up_count--;
            if (state->black_up_count == 0) {
                state->flg_game_over = true;
                return true;
            }
        }
    }

    return false;
}

/**
 * Original name: dm_broken_set
 */
bool dm_broken_set(struct_game_state_data *state, GameMapCell *map) {
    struct_game_state_data_cap_attack_work work[ARRAY_COUNTU(state->cap_attack_work)];
    s32 pad[0x18] UNUSED;
    bool ret = false;
    u32 i;
    u32 j;

    if (state->cap_attack_work[0].unk_0 != 0) {
        if (state->chain_line_max < state->chain_line) {
            state->chain_line_max = state->chain_line;
        }

        state->chain_line = 0;
        state->chain_count = 0;
        state->erase_virus_count = 0;
        state->erase_virus_count_old = 0;

        for (i = 0; i < ARRAY_COUNTU(state->chain_color); i++) {
            state->chain_color[i] = 0;
        }

        for (i = 0, j = 7; i < 0x10; i += 2, j--) {
            u32 chack = state->cap_attack_work[0].unk_0 & (3 << i);

            if (chack != 0) {
                set_map(map, j, 1, 4, (chack >> i) - 1);
            }
        }

        dm_h_ball_chack(map);
        dm_w_ball_chack(map);
        set_down_flg(map);

        for (i = 0; i < ARRAY_COUNTU(state->cap_attack_work); i++) {
            work[i].unk_0 = state->cap_attack_work[i].unk_0;
            work[i].unk_2 = state->cap_attack_work[i].unk_2;
            state->cap_attack_work[i].unk_0 = 0;
            state->cap_attack_work[i].unk_2 = 0;
        }

        for (i = 0, j = 1; i < ARRAY_COUNTU(state->cap_attack_work) - 1; i++, j++) {
            state->cap_attack_work[i].unk_0 = work[j].unk_0;
            state->cap_attack_work[i].unk_2 = work[j].unk_2;
        }

        ret = true;
    }

    return ret;
}

typedef struct dm_calc_erase_score_pos_arg2 {
    /* 0x0 */ s32 x;
    /* 0x4 */ s32 y;
} dm_calc_erase_score_pos_arg2; // size = 0x8

/**
 * Original name: dm_calc_erase_score_pos
 */
void dm_calc_erase_score_pos(struct_game_state_data *state, GameMapCell *map, dm_calc_erase_score_pos_arg2 *pos) {
    s32 row;
    s32 count = 0;

    pos->x = pos->y = 0;

    for (row = 0; row < GAME_MAP_ROWS - 1; row++) {
        s32 column;

        for (column = 0; column < GAME_MAP_COLUMNS; column++) {
            GameMapCell *cell = &map[GAME_MAP_GET_INDEX_ALT(row, column)];

            if (cell->capsel_m_flg[2] != 0) {
                pos->x += cell->pos_m_x;
                pos->y += cell->pos_m_y;
                count++;
            }
        }
    }

    if (count > 0) {
        pos->x = pos->x * state->map_item_size / count;
        pos->y = pos->y * state->map_item_size / count;
    }
}

/**
 * Original name: dm_calc_capsel_pos
 */
bool dm_calc_capsel_pos(struct_game_state_data *state, s32 xx[2], s32 yy[2]) {
