/**
 * Original filename: dm_manual_main.c
 */

#include "dm_manual_main.h"

#include "libultra.h"
#include "libc/assert.h"

#include "macros_defines.h"

#include "audio/sound.h"
#include "graphic.h"
#include "msgwnd.h"
#include "joy.h"
#include "main1x.h"
#include "tex_func.h"
#include "main_story.h"
#include "nnsched.h"
#include "static.h"
#include "dm_virus_init.h"
#include "util.h"

#if VERSION_US || VERSION_GW || CC_CHECK
#include "aiset.h"
#endif

#define STRUCT_WATCHGAME_MANUAL_UNK_LEN 3
#define STRUCT_WATCHGAME_MANUAL_UNK_LEN2 4

/* Original name: STutolWnd */
typedef struct STutolWnd {
    /* 0x00 */ s32 x;                                /* Original name: pos[2] */
    /* 0x04 */ s32 y;                                /* Original name: pos[2] */
    /* 0x08 */ f32 alpha; /* Original name: alpha */ // 0.0f ~ 1.0f
    /* 0x0C */ f32 alphaStep;                        /* Original name: alphaStep */
    /* 0x10 */ MessageWnd messageWnd;                /* Original name: msgWnd */
} STutolWnd;                                         // size = 0x90

typedef struct BigVirusPos {
    /* 0x0 */ s32 unk_0;
    /* 0x4 */ s32 unk_4;
    /* 0x4 */ s32 unk_8;
} BigVirusPos; // size = 0xC

typedef struct AttackCapsel {
    /* 0x0 */ s8 pos_a_x;         /* Original name: pos_a_x */
    /* 0x0 */ s8 pos_a_y;         /* Original name: pos_a_y */
    /* 0x0 */ s8 capsel_a_p;      /* Original name: capsel_a_p */
    /* 0x0 */ s8 capsel_a_flg[3]; /* Original name: capsel_a_flg */
} AttackCapsel;                   // size = 0x6

typedef struct BigVirusFlg {
    /* 0x0 */ bool unk_0;
    /* 0x4 */ bool unk_4;
} BigVirusFlg; // size = 0x8

typedef enum WatchManualMode {
    /*   0 */ WATCHMANUALMODE_0,
    /*   1 */ WATCHMANUALMODE_1,
    /*  10 */ WATCHMANUALMODE_10 = 10,
    /*  20 */ WATCHMANUALMODE_20 = 20,
    /*  21 */ WATCHMANUALMODE_21,
    /*  30 */ WATCHMANUALMODE_30 = 30,
    /*  40 */ WATCHMANUALMODE_40 = 40,
    /*  41 */ WATCHMANUALMODE_41,
    /*  42 */ WATCHMANUALMODE_42,
    /*  43 */ WATCHMANUALMODE_43,
    /*  50 */ WATCHMANUALMODE_50 = 50,
    /*  51 */ WATCHMANUALMODE_51,
    /*  52 */ WATCHMANUALMODE_52,
    /*  53 */ WATCHMANUALMODE_53,
    /*  60 */ WATCHMANUALMODE_60 = 60,
    /*  61 */ WATCHMANUALMODE_61,
    /*  62 */ WATCHMANUALMODE_62,
    /*  63 */ WATCHMANUALMODE_63,
    /*  64 */ WATCHMANUALMODE_64,
    /*  70 */ WATCHMANUALMODE_70 = 70,
    /*  71 */ WATCHMANUALMODE_71,
    /*  72 */ WATCHMANUALMODE_72,
    /*  73 */ WATCHMANUALMODE_73,
    /*  74 */ WATCHMANUALMODE_74,
    /*  80 */ WATCHMANUALMODE_80 = 80,
    /*  81 */ WATCHMANUALMODE_81,
    /*  90 */ WATCHMANUALMODE_90 = 90,
    /*  91 */ WATCHMANUALMODE_91,
    /* 100 */ WATCHMANUALMODE_100 = 100,
    /* 110 */ WATCHMANUALMODE_110 = 110,
    /* 120 */ WATCHMANUALMODE_120 = 120,
    /* 130 */ WATCHMANUALMODE_130 = 130,
    /* 140 */ WATCHMANUALMODE_140 = 140,
    /* 150 */ WATCHMANUALMODE_150 = 150,

    /* 777 */ MODE_CAPSEL_PROC = 777, /* Original name: MODE_CAPSEL_PROC */
    /* 778 */ MODE_WAIT_MESSAGE,      /* Original name: MODE_WAIT_MESSAGE */
    /* 779 */ MODE_WAIT_CAPSEL_FALL,  /* Original name: MODE_WAIT_CAPSEL_FALL */
    /* 780 */ MODE_EXIT,              /* Original name: MODE_EXIT */
} WatchManualMode;

typedef struct struct_watchManual {
    /* 0x000 */ s32 pino_dir;                                               /* Original name: pino_dir */
    /* 0x004 */ s32 pino_pos_x;                                             /* Original name: pino_pos[2] */
    /* 0x008 */ s32 pino_pos_y;                                             /* Original name: pino_pos[2] */
    /* 0x00C */ s32 fade_count;                                             /* Original name: fade_count */
    /* 0x010 */ s32 fade_step;                                              /* Original name: fade_step */
    /* 0x014 */ s32 bgm_timer;                                              /* Original name: bgm_timer */
    /* 0x018 */ s32 bgm_timeout;                                            /* Original name: bgm_timeout */
    /* 0x01C */ s32 key_flash_count[STRUCT_WATCHGAME_MANUAL_UNK_LEN2];      /* Original name: key_flash_count */
    /* 0x02C */ s32 logo_timer;                                             /* Original name: logo_timer */
    /* 0x030 */ s32 capsel_flow; /* Original name: capsel_flow */           // TODO: enum?
    /* 0x034 */ STutolWnd msgWnd;                                           /* Original name: msgWnd */
    /* 0x0C4 */ BigVirusPos big_virus_pos[STRUCT_WATCHGAME_MANUAL_UNK_LEN]; /* Original name: big_virus_pos */
    /* 0x0E8 */ AttackCapsel attack_cap[4][4];                              /* Original name: attack_cap */
    /* 0x148 */ u8 big_virus_count[3]; /* Original name: big_virus_count */ // rgb colors
    /* 0x14C */ BigVirusFlg big_virus_flg[STRUCT_WATCHGAME_MANUAL_UNK_LEN]; /* Original name: big_virus_flg */
    /* 0x164 */ WatchManualMode mode;                                       /* Original name: mode */
    /* 0x168 */ WatchManualMode next_mode;                                  /* Original name: next_mode */
    /* 0x16C */ s32 mode_stop_flg;                                          /* Original name: mode_stop_flg */
    /* 0x170 */ s32 last3_flg;                                              /* Original name: last3_flg */
    /* 0x174 */ s32 attack_cap_count[4];                                    /* Original name: attack_cap_count */
    /* 0x184 */ s32 animeCount;                                             /* Original name: animeCount */
} struct_watchManual;                                                       // size = 0x188

/**
 * Original name: watchManual
 */
struct_watchManual *watchManual;

/**
 * Original name: _texAll
 */
static struct TiTexData *_texAll;
/**
 * Original name: _texKaSa
 */
static struct TiTexData *_texKaSa;

/**
 * Original name: tutolWnd_setPos
 */
void tutolWnd_setPos(STutolWnd *wnd, s32 x, s32 y) {
    wnd->x = x;
    wnd->y = y;
    wnd->messageWnd.posX = x + 8;
    wnd->messageWnd.posY = y + 8;
}

/**
 * Original name: tutolWnd_setAlpha
 */
void tutolWnd_setAlpha(void) {
}

#if VERSION_US || VERSION_GW
#define TUTOLWND_INIT_ROW_STEP 0xD
#elif VERSION_CN
#define TUTOLWND_INIT_ROW_STEP 0xE
#endif

/**
 * Original name: tutolWnd_init
 */
void tutolWnd_init(STutolWnd *wnd, void **heapP) {
    wnd->alpha = 0;
    wnd->alphaStep = (-1 / 16.0f);
