/**
 * Original filename: main_menu.c
 */

#include "libultra.h"
#include "include_asm.h"
#include "macros_defines.h"
#include "unknown_structs.h"
#include "main_segment_functions.h"
#include "main_segment_variables.h"
#include "boot_functions.h"
#include "boot_variables.h"
#include "util.h"
#include "rom_offsets.h"
#include "audio/audio_stuff.h"
#include "buffers.h"
#include "libc/assert.h"
#include "libc/ctype.h"
#include "graphic.h"
#include "record.h"
#include "main1x.h"
#include "028820.h"
#include "tex_func.h"
#include "main_story.h"

#if VERSION_US || CC_CHECK
#include "joy.h"
#endif

#if VERSION_US
f32 func_80045DD0(f32 arg0, f32 arg1) {
    return CLAMP(arg0 + arg1, 0.0f, 1.0f);
}
#endif

#if VERSION_CN
INCLUDE_ASM("asm/cn/nonmatchings/main_segment/main_menu", func_80045DD0);
#endif

#if VERSION_US || VERSION_CN
f32 func_80045E18(f32 arg0, f32 arg1) {
    return WrapF(0.0f, 1.0f, arg0 + arg1);
}
#endif

#if VERSION_US || VERSION_CN
f32 func_80045E48(f32 arg0) {
    if (arg0 < 0.5) {
        arg0 = SQ(arg0);
    } else {
        arg0 = 1.0 - arg0;
        arg0 = 0.5 - SQ(arg0);
    }

    return 2.0f * arg0;
}
#endif

#if VERSION_US
INCLUDE_ASM("asm/us/nonmatchings/main_segment/main_menu", func_80045E94);
#endif

#if VERSION_CN
INCLUDE_ASM("asm/cn/nonmatchings/main_segment/main_menu", func_8004872C_cn);
#endif

#if VERSION_US || VERSION_CN
void transFunc_curve(MenuItem *item) {
    s32 i;
    f32 temp_ft0;
    f32 temp_fv0;


    MenuItem *item = &cursor->unk_140;

    item->transCallback = transFunc_finger;
    item->unk_18 = 1.0f / 32.0f;
    func_8004667C(item, arg1, arg2);
    func_80046670(item, arg1 - 8, arg2);
}
#endif

#if VERSION_US || VERSION_CN
void func_800477BC(MenuCursor *cursor, s32 arg1, s32 arg2) {
    func_8004667C(&cursor->unk_1D0, arg1, arg2);
    func_80046670(&cursor->unk_1D0, arg1, arg2);
}
#endif

#if VERSION_US
extern const f32 _color_1040[4][3];
INCLUDE_RODATA("asm/us/nonmatchings/main_segment/main_menu", _color_1040);
#endif

#if VERSION_CN
const f32 _color_1040[][3] = {
    { 1.0f, 0.3f, 0.3f },
    { 0.3f, 0.3f, 1.0f },
    { 1.0f, 1.0f, 0.0f },
    { 0.0f, 1.0f, 0.0f },
};
#endif

#if VERSION_US || VERSION_CN
void menuCursor_init2(MenuCursor *cursor, struct_watchMenu *watchMenuRef, u32 arg2, s32 arg3, s32 arg4, s32 arg5,
                      s32 arg6, s32 arg7, s32 arg8, s32 arg9) {
    MenuItem *item;
    s32 i;

    if (arg2 < 2U) {
        arg2 = 3;
    }

    cursor->watchMenuRef = watchMenuRef;
    cursor->unk_004 = arg2;
    cursor->unk_008 = arg3;
    cursor->unk_00C = arg4;
    cursor->unk_010 = arg5;
    cursor->unk_014 = arg8;
    cursor->unk_018 = arg9;

    cursor->unk_01C.b.unk_31 = true;
    cursor->unk_01C.b.unk_30 = false;
    cursor->unk_01C.b.unk_29 = false;
    cursor->unk_01C.b.unk_28 = true;

    menuItem_init(&cursor->unk_020, arg6, arg7);

    item = &cursor->unk_0B0;
    menuItem_init(item, 0, 0);
    func_80046734(item, _color_1040[arg5 % ARRAY_COUNTU(_color_1040)][0],
                  _color_1040[arg5 % ARRAY_COUNTU(_color_1040)][1], _color_1040[arg5 % ARRAY_COUNTU(_color_1040)][2]);
    if (arg2 == 3) {
        for (i = 0; i < ARRAY_COUNTU(item->unk_6C[0]); i++) {
            item->unk_6C[0][i] = item->unk_6C[1][i];
        }
    }

    menuItem_init(&cursor->unk_140, 0, 0);
    func_80047720(cursor, -0x14, arg9 - 0xE);

    menuItem_init(&cursor->unk_1D0, 0, 0);
    func_800477BC(cursor, -0x10, arg9 - 0x16);
}
#else
INCLUDE_ASM("asm/cn/nonmatchings/main_segment/main_menu", menuCursor_init2);
#endif

#if VERSION_US
INCLUDE_RODATA("asm/us/nonmatchings/main_segment/main_menu", _pnts_1106);
#endif

#if VERSION_US || VERSION_CN
void func_800479A8(MenuCursor *cursor, struct_watchMenu *watchMenuRef, u32 arg2, s32 arg3, s32 arg4, s32 arg5, s32 arg6,
                   s32 arg7) {
    menuCursor_init2(cursor, watchMenuRef, arg2, 4, 0, arg3, arg4, arg5, arg6, arg7);
}
#endif

#if VERSION_US || VERSION_CN
void menuCursor_update(MenuCursor *cursor, MenuItem *arg1) {
    MenuItem *var_a0;
    s32 i;

    func_800464BC(&cursor->unk_020, arg1);
    var_a0 = &cursor->unk_0B0;
    func_800464BC(var_a0, &cursor->unk_020);
    if (!cursor->unk_01C.b.unk_28) {
        for (i = 0; i < 4U; i++) {
            var_a0->color.arr[i] = var_a0->unk_6C[1][i] * arg1->color.arr[i];
        }
    }

    func_800464BC(&cursor->unk_140, &cursor->unk_020);
    func_800464BC(&cursor->unk_1D0, &cursor->unk_020);
}
#endif

#if VERSION_US
typedef struct struct__pnts_1106 {
    /* 0x00 */ UNK_TYPE4 unk_00;
    /* 0x04 */ UNK_TYPE4 unk_04;
    /* 0x08 */ UNK_TYPE4 unk_08;
    /* 0x0C */ UNK_TYPE4 unk_0C;
    /* 0x10 */ UNK_TYPE4 unk_10;
    /* 0x14 */ UNK_TYPE4 unk_14;
    /* 0x18 */ UNK_TYPE4 unk_18;
    /* 0x1C */ UNK_TYPE4 unk_1C;
} struct__pnts_1106; // size = 0x20

extern const struct__pnts_1106 _pnts_1106[];
extern const s32 _menuCursor_cursor_4_pattern[];

#if 0
// there's an unknown struct array in the stack
void menuCursor_draw1(MenuCursor **cursorArr, s32 count, Gfx **gxfP) {
    s32 sp10;
    s32 sp14;
    s32 sp18;
    s32 sp1C;
    s32 sp20;
    s32 sp24;
    s32 sp28;
    s32 sp2C;
    s32 sp30;
    s32 sp34;
    s32 sp38;
    s32 sp40;
    s32 sp44;
    s32 sp48;
    s32 sp50;
    s32 sp54;
    s32 sp58;
    Gfx *sp60;
    MenuCursor **sp6C;
    s32 sp74;
    Gfx **sp7C;
    s32 sp84;
    MenuCursor **spB4;
    Gfx *temp_a0;
    Gfx *temp_a0_3;
    Gfx *temp_a1_3;
    Gfx *temp_a3;
    Gfx *temp_a3_2;
    Gfx *temp_t0;
    Gfx *temp_t0_2;
    Gfx *temp_v0;
    Gfx *temp_v1;
    Gfx *temp_v1_7;
    MenuCursor **var_t4;
    MenuCursor *temp_s1;
    MenuItem *temp_s2;
    TiTexData *var_s6;
    f32 temp_fv1;
    f32 temp_fv1_2;
    s16 temp_a0_8;
    s16 temp_t3;
