/**
 * Original filename: main1x.c
 */

#include "main1x.h"
#include "include_asm.h"
#include "macros_defines.h"
#include "unknown_structs.h"
#include "main_segment_functions.h"
#include "main_segment_variables.h"
#include "record.h"
#include "vr_init.h"
#include "main_story.h"

#if VERSION_US
u8 evs_stereo = 1;

u8 evs_seqence = 1;

u8 evs_seqnumb = 0;

u8 evs_playcnt = 1;

u8 evs_keyrept[2] = { 0xC, 6 };

u8 evs_gamespeed = 1;

u8 evs_score_flag = 1;

s8 evs_story_flg = 0;

s8 evs_story_no = 0;

s8 evs_story_level = 1;

u8 evs_secret_flg[2] = { 0, 0 };

u8 evs_one_game_flg = 0;

u8 evs_level_21 = 0;

s8 evs_manual_no = EVS_MANUAL_NO_0;

s32 evs_high_score = 0;

s32 evs_vs_count = 3;

u8 FlyingCnt[3] = { 0x28, 0x14, 0x14 };

u8 BonusWait[3][3] = { { 2, 2, 3 }, { 1, 1, 1 }, { 1, 0, 1 } };

u8 D_8008842C[] = { 0x01, 0x02, 0x02, 0x02 };

s8 GameSpeed[4] = { 0, 0xA, 0xF, 0x37 };

u8 FallSpeed[0x38] = {
    0x27, 0x25, 0x23, 0x21, 0x1F, 0x1D, 0x1B, 0x19, 0x17, 0x15, 0x13, 0x12, 0x11, 0x10, 0xF, 0xE, 0xD, 0xC, 0xB,
    0xA,  9,    9,    8,    8,    7,    7,    6,    6,    5,    5,    5,    5,    5,    5,   5,   5,   5,   5,
    5,    5,    4,    4,    4,    4,    4,    3,    3,    3,    3,    3,    2,    2,    2,   2,   2,   1,
};

u8 Score1p[3][6] = {
    { 1, 2, 4, 8, 0x10, 0x20 },
    { 2, 4, 8, 0x10, 0x20, 0x40 },
    { 3, 6, 0xC, 0x18, 0x30, 0x60 },
};
#endif

/**
 * Original name: main11
 */
enum_main_no main11(void) {
    enum_main_no ret = MAIN_NO_3;
    s32 i;

    for (i = 0; i < ARRAY_COUNT(game_state_data); i++) {
        game_state_data[i].unk_026 = 0xA;
        game_state_data[i].unk_02C = 1;
        game_state_data[i].unk_090 = i;
        game_state_data[i].unk_04B = i;
        game_state_data[i].unk_04C = 0;
        game_state_data[i].unk_04D = i;
        game_state_data[i].unk_04E = 1;
        game_state_data[i].unk_16C = 1;
    }

    evs_select_name_no[0] = evs_select_name_no[1] = 8;

    switch (EepRom_Init()) {
        case EEPROM_STATUS_2:
            EepRom_InitFirst(NULL, 0);
            break;

        case EEPROM_STATUS_5:
            ret = MAIN_NO_10;
            break;

        default:
            break;
    }

    return ret;
}

/**
 * Original name: adjust_story_ai
 */
#if VERSION_US
INCLUDE_ASM("asm/us/nonmatchings/main_segment/main1x", adjust_story_ai);
#endif

#if VERSION_CN
#if 0
//extern ? B_8010084C_cn;
//extern ? B_80100CF0_cn;

// ai_char_data // size = 0x6C0

typedef struct struct_ai_char_data {
    /* 0x00 */ UNK_TYPE1 unk_00;
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ UNK_TYPE1 unk_02[0x2];
    /* 0x04 */ UNK_TYPE1 unk_04[0x8];
    /* 0x02 */ UNK_TYPE1 unk_0C[0x2];
    /* 0x02 */ u8 unk_0E;
    /* 0x02 */ UNK_TYPE1 unk_0F[0x1];
    /* 0x02 */ UNK_TYPE1 unk_10[0x10];
    /* 0x02 */ u8 unk_20;
    /* 0x04 */ UNK_TYPE1 unk_21[0x3];
    /* 0x02 */ UNK_TYPE1 unk_24[0x18];
    /* 0x3C */ u8 unk_3C;
    /* 0x3D */ u8 unk_3D;
    /* 0x3E */ UNK_TYPE1 unk_3E;
    /* 0x3E */ UNK_TYPE1 unk_3F[0x1];
    /* 0x40 */ UNK_TYPE1 unk_40[0x2C];
} struct_ai_char_data; // size = 0x6C

extern struct_ai_char_data ai_char_data[0x10];

void adjust_story_ai(void) {

#if 0
    ? *var_v1;
    ? *var_v1_2;
    s32 var_t1;
    s32 var_v0;
    s8 var_v0_3;
    s8 var_v0_4;
    s8 var_v0_5;
    s8 var_v0_6;
    u32 temp_v1_3;
    u32 temp_v1_4;
    u32 temp_v1_5;
    u32 temp_v1_6;
    void *temp_a1;
    void *temp_a3;
    void *temp_v1;
    void *temp_v1_2;
    void *var_a0;
    void *var_a0_2;
    void *var_a2;
    void *var_v0_2;
#endif
    struct_game_state_data * gameStateDataP = game_state_data;

    s32 i; // t1
    //s32 v0;


    for (i = 0; i < evs_playcnt; i++) {
        struct_game_state_data *ptr; // a3

        ptr = &gameStateDataP[i];

        if (ptr->unk_04C != 1) {
            continue;
        }

        ai_char_data[i] = ai_char_data[ptr->unk_04D];


        switch (evs_story_level) {          /* switch 5; irregular */
            case 0x0:                       /* switch 5 */
