/**
 * Original filename: tex_func.c
 */

#include "tex_func.h"

#include "alignment.h"
#include "macros_defines.h"
#include "libc/stdint.h"

#include "util.h"

/**
 * Original name: copy_texture_init_dl
 */
Gfx copy_texture_init_dl[] = {
    gsDPPipeSync(),
    gsDPSetCycleType(G_CYC_COPY),
    gsSPTexture(0x8000, 0x8000, 0, G_TX_RENDERTILE, G_ON),
    gsDPSetRenderMode(G_RM_NOOP, G_RM_NOOP2),
    gsDPSetCombineLERP(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
    gsDPSetAlphaCompare(G_AC_THRESHOLD),
    gsDPSetBlendColor(0x00, 0x00, 0x00, 0x01),
    gsDPSetTextureFilter(G_TF_POINT),
    gsDPSetTextureLUT(G_TT_RGBA16),
    gsDPSetTexturePersp(G_TP_NONE),
    gsDPSetTextureLOD(G_TL_TILE),
    gsDPSetTextureDetail(G_TD_CLAMP),
    gsDPSetTextureConvert(G_TC_FILT),
    gsSPEndDisplayList(),
};

/**
 * Original name: alpha_texture_init_dl
 */
Gfx alpha_texture_init_dl[] = {
    gsDPPipeSync(),
    gsDPSetCycleType(G_CYC_2CYCLE),
    gsSPTexture(0x8000, 0x8000, 0, G_TX_RENDERTILE, G_ON),
    gsDPSetRenderMode(G_RM_PASS, G_RM_XLU_SURF2),
    gsDPSetCombineLERP(0, 0, 0, TEXEL0, 0, 0, 0, TEXEL0, 0, 0, 0, COMBINED, 0, 0, 0, TEXEL0),
    gsDPSetAlphaCompare(G_AC_NONE),
    gsDPSetTextureFilter(G_TF_POINT),
    gsDPSetTextureLUT(G_TT_NONE),
    gsDPSetTexturePersp(G_TP_NONE),
    gsDPSetTextureLOD(G_TL_TILE),
    gsDPSetTextureDetail(G_TD_CLAMP),
    gsDPSetTextureConvert(G_TC_FILT),
    gsSPEndDisplayList(),
};

/**
 * Original name: normal_texture_init_dl
 */
Gfx normal_texture_init_dl[] = {
    gsDPPipeSync(),
    gsDPSetCycleType(G_CYC_1CYCLE),
    gsSPTexture(0x8000, 0x8000, 0, G_TX_RENDERTILE, G_ON),
    gsDPSetRenderMode(G_RM_OPA_SURF, G_RM_OPA_SURF2),
    gsDPSetCombineMode(G_CC_DECALRGBA, G_CC_DECALRGBA),
    gsDPSetAlphaCompare(G_AC_THRESHOLD),
    gsDPSetBlendColor(0x00, 0x00, 0x00, 0x01),
    gsDPSetTextureFilter(G_TF_POINT),
    gsDPSetTextureLUT(G_TT_RGBA16),
    gsDPSetTexturePersp(G_TP_NONE),
    gsDPSetTextureLOD(G_TL_TILE),
    gsDPSetTextureDetail(G_TD_CLAMP),
    gsDPSetTextureConvert(G_TC_FILT),
    gsSPEndDisplayList(),
};

Gfx D_8008E728[] = {
    gsDPPipeSync(),
    gsDPSetCycleType(G_CYC_FILL),
    gsDPSetRenderMode(G_RM_NOOP, G_RM_NOOP2),
    gsSPEndDisplayList(),
};

/**
 * Original name: init_dl_155
 */
Gfx init_dl_155[] = {
    gsDPPipeSync(),
    gsDPSetCycleType(G_CYC_1CYCLE),
    gsDPSetRenderMode(G_RM_XLU_SURF, G_RM_XLU_SURF2),
    gsDPSetCombineMode(G_CC_PRIMITIVE, G_CC_PRIMITIVE),
    gsSPEndDisplayList(),
};

/**
 * Original name: _modes_96
 */
const s32 _modes_96[] = {
    G_SC_ODD_INTERLACE,  // GFXSETSCISSOR_INTERLACE_ODD
    G_SC_EVEN_INTERLACE, // GFXSETSCISSOR_INTERLACE_EVEN
    G_SC_NON_INTERLACE,  // GFXSETSCISSOR_INTERLACE_NO
    G_SC_NON_INTERLACE,  // GFXSETSCISSOR_INTERLACE_NO2
};

/**
 * Original name: gfxSetScissor
 */
void gfxSetScissor(Gfx **gfxP, GfxSetScissorMode mode, s32 x, s32 y, s32 width, s32 height) {
    Gfx *gfx = *gfxP;
    s32 corners[] = {
        CLAMP(x, 0, SCREEN_WIDTH - 1),               // ulx
        CLAMP(y, 0, SCREEN_HEIGHT - 1),              // uly
        CLAMP(x + width - 1, 0, SCREEN_WIDTH - 1),   // lrx
        CLAMP(y + height - 1, 0, SCREEN_HEIGHT - 1), // lry
    };

    gDPSetScissor(gfx++, _modes_96[mode % ARRAY_COUNTU(_modes_96)], corners[0], corners[1], corners[2], corners[3]);

    *gfxP = gfx;
}

/**
 * Original name: FillRectRGB
 */
void FillRectRGB(Gfx **gxfP, s32 x, s32 y, s32 width, s32 height, s32 red, s32 green, s32 blue) {
    Gfx *gfx = *gxfP;
    s32 color = GPACK_RGBA5551(red, green, blue, 1);

    color = color | (color << 0x10);

    gSPDisplayList(gfx++, D_8008E728);
    gDPSetFillColor(gfx++, color);
    gDPScisFillRectangle(gfx++, x, y, x + width - 1, y + height - 1);

    *gxfP = gfx;
}

/**
 * Original name: FillRectRGBA
 */
void FillRectRGBA(Gfx **gfxP, s32 x, s32 y, s32 width, s32 height, s32 red, s32 green, s32 blue, s32 alpha) {
    Gfx *gfx = *gfxP;

    gSPDisplayList(gfx++, init_dl_155);
    gDPSetPrimColor(gfx++, 0, 0, red, green, blue, alpha);
    gDPScisFillRectangle(gfx++, x, y, x + width, y + height);

    *gfxP = gfx;
}

/* Copy block */

struct SCopyTexBlock;

typedef void(SCopyTexBlock_callback)(CONST_ARG struct SCopyTexBlock *st);

/**
 * Original name: SCopyTexBlock
 */
typedef struct SCopyTexBlock {
    /* 0x00 */ Gfx **gfxP;                   /* Original name: gpp */
    /* 0x04 */ const Texture *tex;           /* Original name: tex */
    /* 0x08 */ s32 x;                        /* Original name: x */
    /* 0x0C */ s32 y;                        /* Original name: y */
    /* 0x10 */ s32 w;                        /* Original name: w */
    /* 0x14 */ s32 h;                        /* Original name: h */
    /* 0x18 */ SCopyTexBlock_callback *func; /* Original name: func */
    /* 0x1C */ s32 step;                     /* Original name: step */
    /* 0x20 */ s32 top;                      /* Original name: top */
    /* 0x24 */ s32 bottom;                   /* Original name: bottom */
} SCopyTexBlock;                             // size = 0x28

/**
 * Original name: CopyTexBlock
 */
void CopyTexBlock(SCopyTexBlock *st) {
    s32 x;

    x = st->x;
    if (x >= 0) {
        x <<= 2;
    }

    for (st->top = 0; st->top < st->h; st->top += st->step) {
        st->bottom = MIN(st->top + st->step, st->h);

        if (st->tex != NULL) {
            st->func(st);
        }

        gSPScisTextureRectangle((*st->gfxP)++, x, (st->y + st->top) << 2, ((st->x + st->w) - 1) << 2,
                                ((st->y + st->bottom) - 1) << 2, G_TX_RENDERTILE, 0, 0, 4 << 10, 1 << 10);
    }
}

/**
 * Original name: CopyTexBlock4_LoadTex
 */
void CopyTexBlock4_LoadTex(CONST_ARG SCopyTexBlock *st) {
    gDPLoadTextureBlock_4b((*st->gfxP)++, (u8 *)st->tex + ((st->w * st->top) / 2), G_IM_FMT_CI, st->w,
                           st->bottom - st->top, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMASK,
                           G_TX_NOMASK, G_TX_NOLOD, G_TX_NOLOD);
}

/**
 * Original name: CopyTexBlock4
 */
void CopyTexBlock4(Gfx **gfxP, const u16 tlut[], const u8 tex[], s32 x, s32 y, s32 w, s32 h) {
    SCopyTexBlock st;

    st.gfxP = gfxP;

    st.tex = tex;
    st.x = x;
    st.y = y;
    st.w = w;
    st.h = h;
    st.func = CopyTexBlock4_LoadTex;
    st.step = 0x1000 / w;

    gSPDisplayList((*gfxP)++, copy_texture_init_dl);

    if (tlut != NULL) {
        gDPLoadTLUT_pal16((*gfxP)++, 0, tlut);
    }

    CopyTexBlock(&st);
}

/**
 * Original name: CopyTexBlock8_LoadTex
 */
void CopyTexBlock8_LoadTex(CONST_ARG SCopyTexBlock *st) {
    gDPLoadTextureBlock((*st->gfxP)++, (u8 *)st->tex + st->w * st->top, G_IM_FMT_CI, G_IM_SIZ_8b, st->w,
                        st->bottom - st->top, 0, G_TX_CLAMP, G_TX_CLAMP, G_TX_NOMASK, G_TX_NOMASK, G_TX_NOLOD,
                        G_TX_NOLOD);
}

/**
 * Original name: CopyTexBlock8
 */
void CopyTexBlock8(Gfx **gfxP, const u16 tlut[], const u8 tex[], s32 x, s32 y, s32 w, s32 h) {
    SCopyTexBlock st;

    st.gfxP = gfxP;
    st.tex = tex;
    st.x = x;
    st.y = y;
    st.w = w;
    st.h = h;
    st.func = CopyTexBlock8_LoadTex;
    st.step = 0x800 / w;

    gSPDisplayList((*gfxP)++, copy_texture_init_dl);

    if (tlut != NULL) {
        gDPLoadTLUT_pal256((*gfxP)++, tlut);
    }

    CopyTexBlock(&st);
}

/**
 * Original name: CopyTexBlock16_LoadTex
 */
void CopyTexBlock16_LoadTex(CONST_ARG SCopyTexBlock *st) {
    gDPLoadTextureBlock((*st->gfxP)++, (u16 *)st->tex + st->w * st->top, G_IM_FMT_RGBA, G_IM_SIZ_16b, st->w,
                        st->bottom - st->top, 0, G_TX_CLAMP, G_TX_CLAMP, G_TX_NOMASK, G_TX_NOMASK, G_TX_NOLOD,
                        G_TX_NOLOD);
}

/**
 * Original name: CopyTexBlock16
 */
void CopyTexBlock16(Gfx **gfxP, const u16 tex[], s32 x, s32 y, s32 w, s32 h) {
    SCopyTexBlock st;

    st.gfxP = gfxP;
    st.tex = tex;

    st.x = x;
    st.y = y;
    st.w = w;
    st.h = h;

    st.func = CopyTexBlock16_LoadTex;
    st.step = 0x800 / w;

    gSPDisplayList((*gfxP)++, copy_texture_init_dl);
    gDPSetTextureLUT((*gfxP)++, G_TT_NONE);

    CopyTexBlock(&st);
}

/* Stretch block */

struct SStretchTexBlock;

typedef void(SStretchTexBlock_callback)(CONST_ARG struct SStretchTexBlock *st);

typedef struct SStretchTex_Rect {
    /* 0x00 */ s32 xl;
    /* 0x04 */ s32 yl;
    /* 0x08 */ s32 xh;
    /* 0x0C */ s32 yh;
    /* 0x10 */ s32 s;
    /* 0x14 */ s32 t;
    /* 0x18 */ s32 dsdx;
    /* 0x1C */ s32 dtdy;
} SStretchTex_Rect; // size = 0x20

/**
 * Original name: SStretchTexBlock
 */
typedef struct SStretchTexBlock {
    /* 0x00 */ Gfx **gfxP;                                      /* Original name: gpp */
    /* 0x04 */ Vtx **vpp; /* Original name: vpp */              // unused
    /* 0x08 */ s32 texW;                                        /* Original name: texW */
    /* 0x0C */ s32 texH;                                        /* Original name: texH */
    /* 0x10 */ const Texture *colorTex;                         /* Original name: colorTex */
    /* 0x14 */ s32 colorTexW;                                   /* Original name: colorTexW */
    /* 0x18 */ const Texture *alphaTex;                         /* Original name: alphaTex */
    /* 0x1C */ s32 alphaTexW;                                   /* Original name: alphaTexW */
    /* 0x20 */ s32 x;                                           /* Original name: x */
    /* 0x24 */ s32 y;                                           /* Original name: y */
    /* 0x28 */ s32 w;                                           /* Original name: w */
    /* 0x2C */ s32 h;                                           /* Original name: h */
    /* 0x30 */ SStretchTexBlock_callback *colorFunc;            /* Original name: colorFunc */
    /* 0x34 */ SStretchTexBlock_callback *alphaFunc;            /* Original name: alphaFunc */
    /* 0x38 */ s32 step;                                        /* Original name: step */
    /* 0x3C */ SStretchTexBlock_callback *rectFunc;             /* Original name: rectFunc */
    /* 0x40 */ s32 top;                                         /* Original name: top */
    /* 0x44 */ s32 bottom;                                      /* Original name: bottom */
    /* 0x48 */ s32 loadH;                                       /* Original name: loadH */
    /* 0x4C */ SStretchTex_Rect rect; /* Original name: rect */ // Originally int rect[8]
} SStretchTexBlock;                                             // size = 0x6C

/**
 * Original name: StretchTexBlock
 */
void StretchTexBlock(SStretchTexBlock *st) {
    s32 sp18[2];
    SStretchTex_Rect *t;
    s32 w;
    s32 h;
    s32 biStep;
    u32 var_s4;

    if (st->w < 0) {
        w = -st->w;
        sp18[0] = -1;
    } else if (st->w > 0) {
        w = st->w;
        sp18[0] = 1;
    } else {
        return;
    }

    if (st->h < 0) {
        h = -st->h;
        sp18[1] = -1;
    } else if (st->h > 0) {
        h = st->h;
        sp18[1] = 1;
    } else {
        return;
    }

    if ((st->vpp == NULL) && (w == (st->texW << 2)) && (h == (st->texH << 2))) {
        gDPSetTextureFilter((*st->gfxP)++, G_TF_POINT);
        var_s4 = 0;
        biStep = st->step;
    } else {
        gDPSetTextureFilter((*st->gfxP)++, G_TF_BILERP);
        var_s4 = ~0;
        biStep = MAX(st->step - 1, 1);
    }

    t = &st->rect;

    t->xl = st->x;
    t->xh = st->x + w;
    t->s = ((sp18[0] < 0) ? (st->texW - 1) : 0) << 5;
    t->dsdx = ((sp18[0] << 0xC) * st->texW) / w;

    for (st->top = 0; st->top < st->texH; st->top += biStep) {
        st->bottom = MIN(st->top + st->step, st->texH);
        st->loadH = st->bottom - st->top;
        if (st->colorTex != NULL) {
            st->colorFunc(st);
        }
        if (st->alphaTex != NULL) {
            st->alphaFunc(st);
        }

        if (sp18[1] < 0) {
            t->yl = st->texH - st->bottom;
            t->yh = st->texH - st->top;
            t->t = st->loadH - 1;
        } else {
            t->yl = st->top;
            t->yh = st->bottom;
            t->t = 0;
        }

        t->yl = st->y + (((t->yl << 2) * h) / (st->texH << 2));
        t->yh = st->y + (((t->yh << 2) * h) / (st->texH << 2));
        t->t = t->t << 5;
        t->dtdy = (sp18[1] << 0xC) * st->texH / h;
        t->t -= (t->dtdy / (1 << 6)) & var_s4;

        st->rectFunc(st);
    }
}

/**
 * Original name: StretchTexBlock_ScisRect
 */
void StretchTexBlock_ScisRect(CONST_ARG SStretchTexBlock *st) {
    CONST_ARG SStretchTex_Rect *t = &st->rect;

    gSPScisTextureRectangle((*st->gfxP)++, t->xl, t->yl, t->xh, t->yh, G_TX_RENDERTILE, t->s, t->t, t->dsdx, t->dtdy);
}

/**
 * Original name: StretchAlphaTexBlock_LoadColorTex
 */
void StretchAlphaTexBlock_LoadColorTex(CONST_ARG SStretchTexBlock *st) {
    gDPLoadTextureBlock((*st->gfxP)++, (u16 *)st->colorTex + (st->colorTexW * st->top), G_IM_FMT_RGBA, G_IM_SIZ_16b,
                        st->colorTexW, st->loadH, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP,
                        G_TX_NOMASK, G_TX_NOMASK, G_TX_NOLOD, G_TX_NOLOD);
}

/**
 * Original name: StretchAlphaTexBlock_LoadAlphaTex
 */
void StretchAlphaTexBlock_LoadAlphaTex(CONST_ARG SStretchTexBlock *st) {
    // TODO: what is 0x19A?
    gDPLoadMultiBlock_4b((*st->gfxP)++, (u8 *)st->alphaTex + (st->alphaTexW * st->top) / 2, 0x19A, 1, G_IM_FMT_I,
                         st->alphaTexW, st->loadH, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP,
                         G_TX_NOMASK, G_TX_NOMASK, G_TX_NOLOD, G_TX_NOLOD);
}

/**
 * Original name: StretchAlphaTexBlock
 */
void StretchAlphaTexBlock(Gfx **gfxP, s32 texW, s32 texH, const u16 colorTex[], s32 colorTexW, const u8 alphaTex[],
                          s32 alphaTexW, f32 x, f32 y, f32 w, f32 h) {
    SStretchTexBlock st;

    st.gfxP = gfxP;
    st.vpp = NULL;
    st.texW = texW;
    st.texH = texH;
    st.colorTex = colorTex;
    st.colorTexW = colorTexW;
    st.alphaTex = alphaTex;
    st.alphaTexW = alphaTexW;

    st.x = x * DOUBLE_LITERAL(4);
    st.y = y * DOUBLE_LITERAL(4);
    st.w = w * DOUBLE_LITERAL(4);
    st.h = h * DOUBLE_LITERAL(4);

    st.colorFunc = StretchAlphaTexBlock_LoadColorTex;
    st.alphaFunc = StretchAlphaTexBlock_LoadAlphaTex;

    st.step = 0x660 / MAX(colorTexW, alphaTexW);
    st.rectFunc = StretchTexBlock_ScisRect;

    StretchTexBlock(&st);
}

/**
 * Original name: StretchTexBlock4_LoadTex
 */
void StretchTexBlock4_LoadTex(CONST_ARG SStretchTexBlock *st) {
    gDPLoadTextureBlock_4b((*st->gfxP)++, (u8 *)st->colorTex + ((st->colorTexW * st->top) / 2), G_IM_FMT_CI,
                           st->colorTexW, st->loadH, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP,
                           G_TX_NOMASK, G_TX_NOMASK, G_TX_NOLOD, G_TX_NOLOD);
}

/**
 * Original name: StretchTexBlock4
 */
void StretchTexBlock4(Gfx **gfxP, s32 texW, s32 texH, const u16 tlut[], const u8 tex[], f32 x, f32 y, f32 w, f32 h) {
    SStretchTexBlock st;

    st.gfxP = gfxP;
    st.vpp = NULL;
    st.texW = texW;
    st.texH = texH;

    st.colorTexW = texW;
    st.alphaTex = NULL;

    st.alphaTexW = 0;
    st.alphaFunc = NULL;

    st.colorFunc = StretchTexBlock4_LoadTex;
    st.rectFunc = StretchTexBlock_ScisRect;
    st.colorTex = tex;

    st.x = x * DOUBLE_LITERAL(4);
    st.y = y * DOUBLE_LITERAL(4);
    st.w = w * DOUBLE_LITERAL(4);
    st.h = h * DOUBLE_LITERAL(4);

    st.step = 0x1000 / texW;

    if (tlut != NULL) {
        gDPLoadTLUT_pal16((*gfxP)++, 0, tlut);
    }

    StretchTexBlock(&st);
}

/**
 * Original name: StretchTexBlock8_LoadTex
 */
void StretchTexBlock8_LoadTex(CONST_ARG SStretchTexBlock *st) {
    gDPLoadTextureBlock((*st->gfxP)++, (u8 *)st->colorTex + (st->colorTexW * st->top), G_IM_FMT_CI, G_IM_SIZ_8b,
                        st->colorTexW, st->loadH, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP,
                        G_TX_NOMASK, G_TX_NOMASK, G_TX_NOLOD, G_TX_NOLOD);
}

/**
 * Original name: StretchTexBlock8
 */
void StretchTexBlock8(Gfx **gfxP, s32 texW, s32 texH, const u16 tlut[], const u8 tex[], f32 x, f32 y, f32 w, f32 h) {
    SStretchTexBlock st;

    st.gfxP = gfxP;
    st.vpp = NULL;
    st.texW = texW;
    st.texH = texH;

    st.colorTexW = texW;
    st.alphaTex = NULL;

    st.alphaTexW = 0;
    st.alphaFunc = NULL;

    st.colorFunc = StretchTexBlock8_LoadTex;
    st.rectFunc = StretchTexBlock_ScisRect;
    st.colorTex = tex;

    st.x = x * DOUBLE_LITERAL(4);
    st.y = y * DOUBLE_LITERAL(4);
    st.w = w * DOUBLE_LITERAL(4);
    st.h = h * DOUBLE_LITERAL(4);

    st.step = 0x800 / texW;

    if (tlut != NULL) {
        gDPLoadTLUT_pal256((*gfxP)++, tlut);
    }

    StretchTexBlock(&st);
}

/**
 * Original name: StretchTexBlock16_LoadTex
 */
void StretchTexBlock16_LoadTex(CONST_ARG SStretchTexBlock *st) {
    gDPLoadTextureBlock((*st->gfxP)++, (u16 *)st->colorTex + (st->colorTexW * st->top), G_IM_FMT_RGBA, G_IM_SIZ_16b,
                        st->colorTexW, st->loadH, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP,
                        G_TX_NOMASK, G_TX_NOMASK, G_TX_NOLOD, G_TX_NOLOD);
}

/**
 * Original name: StretchTexBlock16
 */
void StretchTexBlock16(Gfx **gfxP, s32 texW, s32 texH, const u16 tex[], f32 x, f32 y, f32 w, f32 h) {
    SStretchTexBlock st;

    st.gfxP = gfxP;
    st.vpp = NULL;
    st.texW = texW;
    st.texH = texH;

    st.colorTex = tex;
    st.colorTexW = texW;
    st.alphaTex = NULL;
    st.alphaTexW = 0;

    st.colorFunc = StretchTexBlock16_LoadTex;
    st.alphaFunc = NULL;
    st.rectFunc = StretchTexBlock_ScisRect;

    st.x = x * DOUBLE_LITERAL(4);
    st.y = y * DOUBLE_LITERAL(4);
    st.w = w * DOUBLE_LITERAL(4);
    st.h = h * DOUBLE_LITERAL(4);

    st.step = 0x800 / texW;

    StretchTexBlock(&st);
}

/**
 * Original name: StretchTexBlock4i_LoadTex
 */
void StretchTexBlock4i_LoadTex(CONST_ARG SStretchTexBlock *st) {
    gDPLoadTextureBlock_4b((*st->gfxP)++, st->colorTex + (st->colorTexW * st->top) / 2, G_IM_FMT_I, st->colorTexW,
                           st->loadH, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMASK,
                           G_TX_NOMASK, G_TX_NOLOD, G_TX_NOLOD);
}

/**
 * Original name: StretchTexBlock4i
 */
void StretchTexBlock4i(Gfx **gfxP, s32 texW, s32 texH, const u8 tex[], f32 x, f32 y, f32 w, f32 h) {
    SStretchTexBlock st;

    st.gfxP = gfxP;
    st.vpp = NULL;

    st.texW = texW;
    st.texH = texH;

    st.colorTex = tex;
    st.colorTexW = texW;

    st.alphaTex = NULL;
    st.alphaTexW = 0;

    st.colorFunc = StretchTexBlock4i_LoadTex;
    st.alphaFunc = NULL;
    st.rectFunc = StretchTexBlock_ScisRect;

    st.x = x * DOUBLE_LITERAL(4);
    st.y = y * DOUBLE_LITERAL(4);
    st.w = w * DOUBLE_LITERAL(4);
    st.h = h * DOUBLE_LITERAL(4);

    st.step = 0x2000 / texW;

    StretchTexBlock(&st);
}

void StretchTexBlock8i_LoadTex(CONST_ARG SStretchTexBlock *st) {
    gDPLoadTextureBlock((*st->gfxP)++, st->colorTex + (st->colorTexW * st->top), G_IM_FMT_I, G_IM_SIZ_8b, st->colorTexW,
                        st->loadH, 0, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMIRROR | G_TX_CLAMP, G_TX_NOMASK, G_TX_NOMASK,
                        G_TX_NOLOD, G_TX_NOLOD);
}

void StretchTexBlock8i(Gfx **gfxP, s32 texW, s32 texH, const u8 tex[], f32 x, f32 y, f32 w, f32 h) {
    SStretchTexBlock st;

    st.gfxP = gfxP;
    st.vpp = NULL;

    st.texW = texW;
    st.texH = texH;

    st.colorTex = tex;
    st.colorTexW = texW;
    st.alphaTex = NULL;
    st.alphaTexW = 0;

    st.colorFunc = StretchTexBlock8i_LoadTex;
    st.alphaFunc = NULL;
    st.rectFunc = StretchTexBlock_ScisRect;

    st.x = x * DOUBLE_LITERAL(4);
    st.y = y * DOUBLE_LITERAL(4);
    st.w = w * DOUBLE_LITERAL(4);
    st.h = h * DOUBLE_LITERAL(4);

    st.step = 0x1000 / texW;

    StretchTexBlock(&st);
}

/* Stretch tile */

struct SStretchTexTile;

typedef void (*SStretchTexTile_callback)(CONST_ARG struct SStretchTexTile *st);

/**
 * Original name: SStretchTexTile
 */
typedef struct SStretchTexTile {
    /* 0x00 */ Gfx **gfxP;                                      /* Original name: gpp */
    /* 0x04 */ Vtx **vtxP;                                      /* Original name: vpp */
    /* 0x08 */ s32 texW;                                        /* Original name: texW */
    /* 0x0C */ s32 texH;                                        /* Original name: texH */
    /* 0x10 */ const Texture *colorTex;                         /* Original name: colorTex */
    /* 0x14 */ s32 colorTexW;                                   /* Original name: colorTexW */
    /* 0x18 */ const u8 *alphaTex;                              /* Original name: alphaTex */
    /* 0x1C */ s32 alphaTexW;                                   /* Original name: alphaTexW */
    /* 0x20 */ s32 lx;                                          /* Original name: lx */
    /* 0x24 */ s32 ly;                                          /* Original name: ly */
    /* 0x28 */ s32 lw;                                          /* Original name: lw */
    /* 0x2C */ s32 lh;                                          /* Original name: lh */
    /* 0x30 */ s32 x;                                           /* Original name: x */
    /* 0x34 */ s32 y;                                           /* Original name: y */
    /* 0x38 */ s32 w;                                           /* Original name: w */
    /* 0x3C */ s32 h;                                           /* Original name: h */
    /* 0x40 */ SStretchTexTile_callback colorFunc;              /* Original name: colorFunc */
    /* 0x44 */ SStretchTexTile_callback alphaFunc;              /* Original name: alphaFunc */
    /* 0x48 */ s32 step;                                        /* Original name: step */
    /* 0x4C */ SStretchTexTile_callback rectFunc;               /* Original name: rectFunc */
    /* 0x50 */ s32 top;                                         /* Original name: top */
    /* 0x54 */ s32 bottom;                                      /* Original name: bottom */
    /* 0x58 */ SStretchTex_Rect rect; /* Original name: rect */ // Originally int rect[8]
} SStretchTexTile;                                              // size = 0x78

/**
 * Original name: StretchTexTile
 */
void StretchTexTile(SStretchTexTile *st) {
    s32 sp18[2];
    SStretchTex_Rect *t;
    s32 w;
    s32 h;
    s32 biStep;
    u32 var_s5;
    s32 endX;
    s32 endY;

    if (st->w < 0) {
        w = -st->w;
        sp18[0] = -1;
    } else if (st->w > 0) {
        w = st->w;
        sp18[0] = 1;
    } else {
        return;
    }

    if (st->h < 0) {
        h = -st->h;
        sp18[1] = -1;
    } else if (st->h > 0) {
        h = st->h;
        sp18[1] = 1;
    } else {
        return;
    }

    endX = st->lx + st->lw;
    endY = st->ly + st->lh;
    if ((st->vtxP == NULL) && (w == (st->lw << 2)) && (h == (st->lh << 2))) {
        gDPSetTextureFilter((*st->gfxP)++, G_TF_POINT);
        var_s5 = 0;
        biStep = st->step;
    } else {
