#ifndef _066080_H
#define _066080_H

#include "libultra.h"

typedef struct struct_8007E260_arg0 {
    /* 0x0 */ f32 unk_0;
    /* 0x4 */ f32 unk_4;
    /* 0x8 */ f32 unk_8;
} struct_8007E260_arg0; // size >= 0xC

typedef struct struct_8007E260_arg1 {
    /* 0x0 */ f32 unk_0;
    /* 0x4 */ f32 unk_4;
    /* 0x8 */ f32 unk_8;
} struct_8007E260_arg1; // size >= 0xC

typedef struct struct_8007E260_arg2 {
    /* 0x0 */ f32 unk_0;
    /* 0x4 */ f32 unk_4;
    /* 0x8 */ f32 unk_8;
} struct_8007E260_arg2; // size >= 0xC

void func_8007E260(struct_8007E260_arg0 *arg0, struct_8007E260_arg1 *arg1, struct_8007E260_arg2 *arg2);

#endif
